title: [翻译]GitHub的光明未来
show: true
date: 2018-06-05 22:57:10
tags: [翻译]
categories: 技术人生
---

<i class="iconfont" style="color: #1296db">&#xe65d;</i> 16/53，每周一篇博，坚持！

(翻译自[Github blog](https://blog.github.com/2018-06-04-github-microsoft/))
![](https://user-images.githubusercontent.com/98681/40890924-4bad5ce0-6732-11e8-9648-192aa71f0830.png)

我很高兴地宣布，微软正在谋求收购Github并且有望在今年年底完成收购协议。虽然最终达成收购还需要几个月的时间，但我们想尽快分享这个消息给大家。

当十年前刚建立Github的时候，我从未想到过这个“标题”。Git是一个强大且优秀的工具（原文niche疑为nice笔误），“云”只是天上的东西，而微软则是一个非常不同的公司。人们谈论到开源和商业的时候，仿佛它们是水火不容的两件事。

<!--more-->

然而我们不同意。作为开发者，我们知道这是一个错误的对立----我们长期以来一直在商业环境中成功地使用开源软件。我们真正需要的是一个更简单的同其他人协同工作的方式，无论代码是公开的、私有的还是二者兼有。我们希望使用Git达成这一所愿，我们希望世界上的任何人都能够加入进来，如果代码是开源的，我们不希望花费一分钱。所以我们创建了Github。

当然现在情况已经完全不同了。Git已经是最流行的版本控制系统，“云”也变成了非常非常多的电脑的意思，而微软也成为了当今Github上最为活跃的组织。仅仅他们的VS Code项目就获得了上百万开发者的点赞，VS Code完完全全地开放源码并且使用Github的Electron平台进行构建。除此之外，现如今大型企业也都习惯了拥抱开源。世界已经意识到快乐并高产的开发人员有多么重要。并且人们现在也都拥有智能手机了。

然而没变的是，我们的聚焦点依然在开发者身上。一开始，我们一直着迷于打造一款人们正在使用的产品。我们希望让开发者们更加多产，更多的人成为开发者。从“Code to Cloud,Code to Edge"，Github的使命是帮助每一个开发者----无论他们的经验水平如何----有效地学习，编写并提供软件。

因此当我们期待未来十年的软件开发的时候，我们知道那些都会是关于开发者的。正如我们在过去几年中，通过从Git LFS到Electron项目合作中了解到的微软团队，我们了解到他们也是这么看的。他们在开源领域的工作激励了我们，Minecraft（我的世界）和LinkedIn（领英）收购后的成功也向我们表明他们对拓展新业务的是非常认真的，同时Azure的发展也证明他们是一个创新的开发平台。

但不止如此，他们关于未来的认知和我们的观点高度契合。我们都认为Github仍会是一个对所有开发者保持开放的平台。无论您的语种、技术栈、平台、云或者许可证如何，Github将会继续是你的家----那个软件创建、协作、发现的最佳场所。

我们都认为软件开发需要更简单、更加无障碍、更加智能、更加开放，以使更多的人可以成为开发者，已经是开发者的可以花费更多的时间在他们正试图解决的独特的问题上。

我们都看到了开发人员日益增长的需求以及软件在我们生活的各个方面日益增长的重要性。

更为重要的是，我们都认为我们一起可以比双方独自时做到更好。毕竟，合作正是我们所做事情的核心。

作为变化的一部分，Nat Friedman将成为Github的CEO。我们一直在寻找一位新的CEO，现在在微软和Nat中找到了我们认为将在未来几年加强和发展Github社区和公司的合作伙伴。Nat 拥有相当丰富的软件经验和开源软件社区的经验，曾共同创建了Xamarin，并且在大量的开源软件项目工作过数年。他将是一个帮助Github成长且继续让开发者的生活变得更美好的完美人选。

至于我，我将在与微软和Nat的团队紧密合作中担任一个新的角色，未来会跟大家分享更多的细节。

我对Github和我们的社区在过去十年中所取得的成就感到非常自豪，我迫不及待地想看到未来会发生什么。软件开发的未来是光明的，我很高兴能够与微软一起联手实现这一目标。

[@defunkt](https://github.com/defunkt)
CEO & Co-Founder, GitHub


